codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg144.h
#define _CNFA_CNFA9_POSITION                     0x00000009
#define _CNFA_CNFA9_MASK                         0x00000200
#define _CNFA_CNFA9_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _CNFA_CNFA11_POSITION                    0x0000000B
#define _CNFA_CNFA11_MASK                        0x00000800
#define _CNFA_CNFA11_LENGTH                      0x00000001

#define _CNFA_CNFA12_POSITION                    0x0000000C
#define _CNFA_CNFA12_MASK                        0x00001000
#define _CNFA_CNFA12_LENGTH                      0x00000001

#define _CNFA_CNFA13_POSITION                    0x0000000D
#define _CNFA_CNFA13_MASK                        0x00002000
#define _CNFA_CNFA13_LENGTH                      0x00000001

#define _CNFA_CNFA14_POSITION                    0x0000000E
#define _CNFA_CNFA14_MASK                        0x00004000
#define _CNFA_CNFA14_LENGTH                      0x00000001

#define _CNFA_CNFA15_POSITION                    0x0000000F
#define _CNFA_CNFA15_MASK                        0x00008000
#define _CNFA_CNFA15_LENGTH                      0x00000001

#define _SRCON0A_SR0A0_POSITION                  0x00000000
#define _SRCON0A_SR0A0_MASK                      0x00000001
#define _SRCON0A_SR0A0_LENGTH                    0x00000001

#define _SRCON0A_SR0A1_POSITION                  0x00000001
#define _SRCON0A_SR0A1_MASK                      0x00000002
#define _SRCON0A_SR0A1_LENGTH                    0x00000001

#define _SRCON0A_SR0A2_POSITION                  0x00000002
#define _SRCON0A_SR0A2_MASK                      0x00000004
#define _SRCON0A_SR0A2_LENGTH                    0x00000001

#define _SRCON0A_SR0A3_POSITION                  0x00000003
#define _SRCON0A_SR0A3_MASK                      0x00000008
#define _SRCON0A_SR0A3_LENGTH                    0x00000001

#define _SRCON0A_SR0A4_POSITION                  0x00000004
#define _SRCON0A_SR0A4_MASK                      0x00000010
#define _SRCON0A_SR0A4_LENGTH                    0x00000001

#define _SRCON0A_SR0A5_POSITION                  0x00000005
#define _SRCON0A_SR0A5_MASK                      0x00000020
#define _SRCON0A_SR0A5_LENGTH                    0x00000001

#define _SRCON0A_SR0A6_POSITION                  0x00000006
#define _SRCON0A_SR0A6_MASK                      0x00000040
#define _SRCON0A_SR0A6_LENGTH                    0x00000001

#define _SRCON0A_SR0A7_POSITION                  0x00000007
#define _SRCON0A_SR0A7_MASK                      0x00000080
#define _SRCON0A_SR0A7_LENGTH                    0x00000001

#define _SRCON0A_SR0A8_POSITION                  0x00000008
#define _SRCON0A_SR0A8_MASK                      0x00000100
#define _SRCON0A_SR0A8_LENGTH                    0x00000001

#define _SRCON0A_SR0A9_POSITION                  0x00000009
#define _SRCON0A_SR0A9_MASK                      0x00000200
#define _SRCON0A_SR0A9_LENGTH                    0x00000001

#define _SRCON0A_SR0A10_POSITION                 0x0000000A
#define _SRCON0A_SR0A10_MASK                     0x00000400
#define _SRCON0A_SR0A10_LENGTH                   0x00000001

#define _SRCON0A_SR0A11_POSITION                 0x0000000B
#define _SRCON0A_SR0A11_MASK                     0x00000800
#define _SRCON0A_SR0A11_LENGTH                   0x00000001

#define _SRCON0A_SR0A12_POSITION                 0x0000000C
#define _SRCON0A_SR0A12_MASK                     0x00001000
#define _SRCON0A_SR0A12_LENGTH                   0x00000001

#define _SRCON0A_SR0A13_POSITION                 0x0000000D
#define _SRCON0A_SR0A13_MASK                     0x00002000
#define _SRCON0A_SR0A13_LENGTH                   0x00000001

#define _SRCON0A_SR0A14_POSITION                 0x0000000E
#define _SRCON0A_SR0A14_MASK                     0x00004000
#define _SRCON0A_SR0A14_LENGTH                   0x00000001

#define _SRCON0A_SR0A15_POSITION                 0x0000000F
#define _SRCON0A_SR0A15_MASK                     0x00008000
#define _SRCON0A_SR0A15_LENGTH                   0x00000001

#define _SRCON1A_SR1A0_POSITION                  0x00000000
#define _SRCON1A_SR1A0_MASK                      0x00000001
#define _SRCON1A_SR1A0_LENGTH                    0x00000001

#define _SRCON1A_SR1A1_POSITION                  0x00000001
#define _SRCON1A_SR1A1_MASK                      0x00000002
#define _SRCON1A_SR1A1_LENGTH                    0x00000001

#define _SRCON1A_SR1A2_POSITION                  0x00000002
#define _SRCON1A_SR1A2_MASK                      0x00000004
#define _SRCON1A_SR1A2_LENGTH                    0x00000001

#define _SRCON1A_SR1A3_POSITION                  0x00000003
#define _SRCON1A_SR1A3_MASK                      0x00000008
#define _SRCON1A_SR1A3_LENGTH                    0x00000001

#define _SRCON1A_SR1A4_POSITION                  0x00000004
#define _SRCON1A_SR1A4_MASK                      0x00000010
#define _SRCON1A_SR1A4_LENGTH                    0x00000001

#define _SRCON1A_SR1A5_POSITION                  0x00000005
#define _SRCON1A_SR1A5_MASK                      0x00000020
#define _SRCON1A_SR1A5_LENGTH                    0x00000001

#define _SRCON1A_SR1A6_POSITION                  0x00000006
#define _SRCON1A_SR1A6_MASK                      0x00000040
#define _SRCON1A_SR1A6_LENGTH                    0x00000001

#define _SRCON1A_SR1A7_POSITION                  0x00000007
#define _SRCON1A_SR1A7_MASK                      0x00000080
#define _SRCON1A_SR1A7_LENGTH                    0x00000001

#define _SRCON1A_SR1A8_POSITION                  0x00000008
#define _SRCON1A_SR1A8_MASK                      0x00000100
#define _SRCON1A_SR1A8_LENGTH                    0x00000001

#define _SRCON1A_SR1A9_POSITION                  0x00000009
#define _SRCON1A_SR1A9_MASK                      0x00000200
#define _SRCON1A_SR1A9_LENGTH                    0x00000001

#define _SRCON1A_SR1A10_POSITION                 0x0000000A
#define _SRCON1A_SR1A10_MASK                     0x00000400
#define _SRCON1A_SR1A10_LENGTH                   0x00000001

#define _SRCON1A_SR1A11_POSITION                 0x0000000B
#define _SRCON1A_SR1A11_MASK                     0x00000800
#define _SRCON1A_SR1A11_LENGTH                   0x00000001

#define _SRCON1A_SR1A12_POSITION                 0x0000000C
#define _SRCON1A_SR1A12_MASK                     0x00001000
#define _SRCON1A_SR1A12_LENGTH                   0x00000001

#define _SRCON1A_SR1A13_POSITION                 0x0000000D
#define _SRCON1A_SR1A13_MASK                     0x00002000
#define _SRCON1A_SR1A13_LENGTH                   0x00000001

#define _SRCON1A_SR1A14_POSITION                 0x0000000E
#define _SRCON1A_SR1A14_MASK                     0x00004000
#define _SRCON1A_SR1A14_LENGTH                   0x00000001

#define _SRCON1A_SR1A15_POSITION                 0x0000000F
#define _SRCON1A_SR1A15_MASK                     0x00008000
#define _SRCON1A_SR1A15_LENGTH                   0x00000001

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

