codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg144.h
#define _CNNEK_CNNEK1_POSITION                   0x00000001
#define _CNNEK_CNNEK1_MASK                       0x00000002
#define _CNNEK_CNNEK1_LENGTH                     0x00000001

#define _CNNEK_CNNEK2_POSITION                   0x00000002
#define _CNNEK_CNNEK2_MASK                       0x00000004
#define _CNNEK_CNNEK2_LENGTH                     0x00000001

#define _CNNEK_CNNEK3_POSITION                   0x00000003
#define _CNNEK_CNNEK3_MASK                       0x00000008
#define _CNNEK_CNNEK3_LENGTH                     0x00000001

#define _CNNEK_CNNEK4_POSITION                   0x00000004
#define _CNNEK_CNNEK4_MASK                       0x00000010
#define _CNNEK_CNNEK4_LENGTH                     0x00000001

#define _CNNEK_CNNEK5_POSITION                   0x00000005
#define _CNNEK_CNNEK5_MASK                       0x00000020
#define _CNNEK_CNNEK5_LENGTH                     0x00000001

#define _CNNEK_CNNEK6_POSITION                   0x00000006
#define _CNNEK_CNNEK6_MASK                       0x00000040
#define _CNNEK_CNNEK6_LENGTH                     0x00000001

#define _CNNEK_CNNEK7_POSITION                   0x00000007
#define _CNNEK_CNNEK7_MASK                       0x00000080
#define _CNNEK_CNNEK7_LENGTH                     0x00000001

#define _CNNEK_CNNEK8_POSITION                   0x00000008
#define _CNNEK_CNNEK8_MASK                       0x00000100
#define _CNNEK_CNNEK8_LENGTH                     0x00000001

#define _CNNEK_CNNEK9_POSITION                   0x00000009
#define _CNNEK_CNNEK9_MASK                       0x00000200
#define _CNNEK_CNNEK9_LENGTH                     0x00000001

#define _CNNEK_CNNEK10_POSITION                  0x0000000A
#define _CNNEK_CNNEK10_MASK                      0x00000400
#define _CNNEK_CNNEK10_LENGTH                    0x00000001

#define _CNNEK_CNNEK11_POSITION                  0x0000000B
#define _CNNEK_CNNEK11_MASK                      0x00000800
#define _CNNEK_CNNEK11_LENGTH                    0x00000001

#define _CNNEK_CNNEK12_POSITION                  0x0000000C
#define _CNNEK_CNNEK12_MASK                      0x00001000
#define _CNNEK_CNNEK12_LENGTH                    0x00000001

#define _CNNEK_CNNEK13_POSITION                  0x0000000D
#define _CNNEK_CNNEK13_MASK                      0x00002000
#define _CNNEK_CNNEK13_LENGTH                    0x00000001

#define _CNNEK_CNNEK14_POSITION                  0x0000000E
#define _CNNEK_CNNEK14_MASK                      0x00004000
#define _CNNEK_CNNEK14_LENGTH                    0x00000001

#define _CNNEK_CNNEK15_POSITION                  0x0000000F
#define _CNNEK_CNNEK15_MASK                      0x00008000
#define _CNNEK_CNNEK15_LENGTH                    0x00000001

#define _CNFK_CNFK0_POSITION                     0x00000000
#define _CNFK_CNFK0_MASK                         0x00000001
#define _CNFK_CNFK0_LENGTH                       0x00000001

#define _CNFK_CNFK1_POSITION                     0x00000001
#define _CNFK_CNFK1_MASK                         0x00000002
#define _CNFK_CNFK1_LENGTH                       0x00000001

#define _CNFK_CNFK2_POSITION                     0x00000002
#define _CNFK_CNFK2_MASK                         0x00000004
#define _CNFK_CNFK2_LENGTH                       0x00000001

#define _CNFK_CNFK3_POSITION                     0x00000003
#define _CNFK_CNFK3_MASK                         0x00000008
#define _CNFK_CNFK3_LENGTH                       0x00000001

#define _CNFK_CNFK4_POSITION                     0x00000004
#define _CNFK_CNFK4_MASK                         0x00000010
#define _CNFK_CNFK4_LENGTH                       0x00000001

#define _CNFK_CNFK5_POSITION                     0x00000005
#define _CNFK_CNFK5_MASK                         0x00000020
#define _CNFK_CNFK5_LENGTH                       0x00000001

#define _CNFK_CNFK6_POSITION                     0x00000006
#define _CNFK_CNFK6_MASK                         0x00000040
#define _CNFK_CNFK6_LENGTH                       0x00000001

#define _CNFK_CNFK7_POSITION                     0x00000007
#define _CNFK_CNFK7_MASK                         0x00000080
#define _CNFK_CNFK7_LENGTH                       0x00000001

#define _CNFK_CNFK8_POSITION                     0x00000008
#define _CNFK_CNFK8_MASK                         0x00000100
#define _CNFK_CNFK8_LENGTH                       0x00000001

#define _CNFK_CNFK9_POSITION                     0x00000009
#define _CNFK_CNFK9_MASK                         0x00000200
#define _CNFK_CNFK9_LENGTH                       0x00000001

#define _CNFK_CNFK10_POSITION                    0x0000000A
#define _CNFK_CNFK10_MASK                        0x00000400
#define _CNFK_CNFK10_LENGTH                      0x00000001

#define _CNFK_CNFK11_POSITION                    0x0000000B
#define _CNFK_CNFK11_MASK                        0x00000800
#define _CNFK_CNFK11_LENGTH                      0x00000001

#define _CNFK_CNFK12_POSITION                    0x0000000C
#define _CNFK_CNFK12_MASK                        0x00001000
#define _CNFK_CNFK12_LENGTH                      0x00000001

#define _CNFK_CNFK13_POSITION                    0x0000000D
#define _CNFK_CNFK13_MASK                        0x00002000
#define _CNFK_CNFK13_LENGTH                      0x00000001

#define _CNFK_CNFK14_POSITION                    0x0000000E
#define _CNFK_CNFK14_MASK                        0x00004000
#define _CNFK_CNFK14_LENGTH                      0x00000001

#define _CNFK_CNFK15_POSITION                    0x0000000F
#define _CNFK_CNFK15_MASK                        0x00008000
#define _CNFK_CNFK15_LENGTH                      0x00000001

#define _ETHCON1_BUFCDEC_POSITION                0x00000000
#define _ETHCON1_BUFCDEC_MASK                    0x00000001
#define _ETHCON1_BUFCDEC_LENGTH                  0x00000001

#define _ETHCON1_MANFC_POSITION                  0x00000004
#define _ETHCON1_MANFC_MASK                      0x00000010
#define _ETHCON1_MANFC_LENGTH                    0x00000001

#define _ETHCON1_AUTOFC_POSITION                 0x00000007
#define _ETHCON1_AUTOFC_MASK                     0x00000080
#define _ETHCON1_AUTOFC_LENGTH                   0x00000001

#define _ETHCON1_RXEN_POSITION                   0x00000008
#define _ETHCON1_RXEN_MASK                       0x00000100
#define _ETHCON1_RXEN_LENGTH                     0x00000001

#define _ETHCON1_TXRTS_POSITION                  0x00000009
#define _ETHCON1_TXRTS_MASK                      0x00000200
#define _ETHCON1_TXRTS_LENGTH                    0x00000001

#define _ETHCON1_SIDL_POSITION                   0x0000000D
#define _ETHCON1_SIDL_MASK                       0x00002000
#define _ETHCON1_SIDL_LENGTH                     0x00000001

#define _ETHCON1_ON_POSITION                     0x0000000F
#define _ETHCON1_ON_MASK                         0x00008000
#define _ETHCON1_ON_LENGTH                       0x00000001

#define _ETHCON1_PTV_POSITION                    0x00000010
#define _ETHCON1_PTV_MASK                        0xFFFF0000
#define _ETHCON1_PTV_LENGTH                      0x00000010

#define _ETHCON1_w_POSITION                      0x00000000
#define _ETHCON1_w_MASK                          0xFFFFFFFF
#define _ETHCON1_w_LENGTH                        0x00000020

#define _ETHCON2_RXBUF_SZ_POSITION               0x00000004
#define _ETHCON2_RXBUF_SZ_MASK                   0x000007F0
#define _ETHCON2_RXBUF_SZ_LENGTH                 0x00000007

#define _ETHCON2_w_POSITION                      0x00000000
#define _ETHCON2_w_MASK                          0xFFFFFFFF
#define _ETHCON2_w_LENGTH                        0x00000020

#define _ETHTXST_TXSTADDR_POSITION               0x00000002
#define _ETHTXST_TXSTADDR_MASK                   0xFFFFFFFC
#define _ETHTXST_TXSTADDR_LENGTH                 0x0000001E

#define _ETHTXST_w_POSITION                      0x00000000
#define _ETHTXST_w_MASK                          0xFFFFFFFF
#define _ETHTXST_w_LENGTH                        0x00000020

#define _ETHRXST_RXSTADDR_POSITION               0x00000002
#define _ETHRXST_RXSTADDR_MASK                   0xFFFFFFFC
#define _ETHRXST_RXSTADDR_LENGTH                 0x0000001E

